Revit 2027 API
FailuresAccessor.GetFailureMessages Method
Overload List
Name | Description
GetFailureMessages() |  Provides access to the individual failure messages currently posted in the document.
GetFailureMessages(FailureSeverity) |  Provides access to the individual failure messages if a given severity currently posted in the document.
Top
See Also
Reference
FailuresAccessor Class
Autodesk.Revit.DB Namespace